## Plan Result (sbox-global)




<pre><code>Plan: 1 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmcts-access&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox"
        name                                         = "hmcts-sbox"
      ~ tags                                         = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-idam-web-admin" -> "healthProbeSettings-hmcts-access"
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/backendPools/idam-web-admin"
          ~ load_balancing_name = "loadBalancingSettings-idam-web-admin" -> "loadBalancingSettings-hmcts-access"
          ~ name                = "idam-web-admin" -> "hmcts-access"

          ~ backend {
              ~ host_header = "idam-web-admin.sandbox.platform.hmcts.net" -> "hmcts-access.sandbox.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-idam-user-dashboard" -> "healthProbeSettings-idam-web-admin"
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/backendPools/idam-user-dashboard"
          ~ load_balancing_name = "loadBalancingSettings-idam-user-dashboard" -> "loadBalancingSettings-idam-web-admin"
          ~ name                = "idam-user-dashboard" -> "idam-web-admin"

          ~ backend {
              ~ host_header = "idam-user-dashboard.sandbox.platform.hmcts.net" -> "idam-web-admin.sandbox.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-plum" -> "healthProbeSettings-idam-user-dashboard"
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/backendPools/plum"
          ~ load_balancing_name = "loadBalancingSettings-plum" -> "loadBalancingSettings-idam-user-dashboard"
          ~ name                = "plum" -> "idam-user-dashboard"

          ~ backend {
              ~ host_header = "plum.sandbox.platform.hmcts.net" -> "idam-user-dashboard.sandbox.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-hmi-apim" -> "healthProbeSettings-plum"
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/backendPools/hmi-apim"
          ~ load_balancing_name = "loadBalancingSettings-hmi-apim" -> "loadBalancingSettings-plum"
          ~ name                = "hmi-apim" -> "plum"

          ~ backend {
              ~ address     = "firewall-sbox-int-palo-hmiapimsbox.uksouth.cloudapp.azure.com" -> "firewall-sbox-int-palo-sbox.uksouth.cloudapp.azure.com"
              ~ host_header = "hmi-apim.sandbox.platform.hmcts.net" -> "plum.sandbox.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-cft-api-mgmt" -> "healthProbeSettings-hmi-apim"
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/backendPools/cft-api-mgmt"
          ~ load_balancing_name = "loadBalancingSettings-cft-api-mgmt" -> "loadBalancingSettings-hmi-apim"
          ~ name                = "cft-api-mgmt" -> "hmi-apim"

          ~ backend {
              ~ address     = "firewall-sbox-int-palo-cftapimgmt.uksouth.cloudapp.azure.com" -> "firewall-sbox-int-palo-hmiapimsbox.uksouth.cloudapp.azure.com"
              ~ host_header = "cft-api-mgmt.sandbox.platform.hmcts.net" -> "hmi-apim.sandbox.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-reformscan" -> "healthProbeSettings-cft-api-mgmt"
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/backendPools/reformscan"
          ~ load_balancing_name = "loadBalancingSettings-reformscan" -> "loadBalancingSettings-cft-api-mgmt"
          ~ name                = "reformscan" -> "cft-api-mgmt"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-reformscansbox.uksouth.cloudapp.azure.com" -> "firewall-sbox-int-palo-cftapimgmt.uksouth.cloudapp.azure.com"
              ~ host_header = "reformscan.sandbox.platform.hmcts.net" -> "cft-api-mgmt.sandbox.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-labs-louisehuyton-walkthrough" -> "healthProbeSettings-reformscan"
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/backendPools/labs-louisehuyton-walkthrough"
          ~ load_balancing_name = "loadBalancingSettings-labs-louisehuyton-walkthrough" -> "loadBalancingSettings-reformscan"
          ~ name                = "labs-louisehuyton-walkthrough" -> "reformscan"

          ~ backend {
              ~ address     = "firewall-sbox-int-palo-sbox.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-reformscansbox.uksouth.cloudapp.azure.com"
              ~ host_header = "labs-louisehuyton-walkthrough.sandbox.platform.hmcts.net" -> "reformscan.sandbox.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-labs-zcwalkthrough-nodejs" -> "healthProbeSettings-labs-louisehuyton-walkthrough"
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/backendPools/labs-zcwalkthrough-nodejs"
          ~ load_balancing_name = "loadBalancingSettings-labs-zcwalkthrough-nodejs" -> "loadBalancingSettings-labs-louisehuyton-walkthrough"
          ~ name                = "labs-zcwalkthrough-nodejs" -> "labs-louisehuyton-walkthrough"

          ~ backend {
              ~ host_header = "labs-zcwalkthrough-nodejs.sandbox.platform.hmcts.net" -> "labs-louisehuyton-walkthrough.sandbox.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-labs-zcwalkthrough-nodejs"
          + load_balancing_name = "loadBalancingSettings-labs-zcwalkthrough-nodejs"
          + name                = "labs-zcwalkthrough-nodejs"

          + backend {
              + address     = "firewall-sbox-int-palo-sbox.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "labs-zcwalkthrough-nodejs.sandbox.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/healthProbeSettings/healthProbeSettings-idam-web-admin"
          ~ name                = "healthProbeSettings-idam-web-admin" -> "healthProbeSettings-hmcts-access"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/healthProbeSettings/healthProbeSettings-idam-user-dashboard"
          ~ name                = "healthProbeSettings-idam-user-dashboard" -> "healthProbeSettings-idam-web-admin"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/healthProbeSettings/healthProbeSettings-plum"
          ~ name                = "healthProbeSettings-plum" -> "healthProbeSettings-idam-user-dashboard"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/healthProbeSettings/healthProbeSettings-hmi-apim"
          ~ name                = "healthProbeSettings-hmi-apim" -> "healthProbeSettings-plum"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/healthProbeSettings/healthProbeSettings-cft-api-mgmt"
          ~ name                = "healthProbeSettings-cft-api-mgmt" -> "healthProbeSettings-hmi-apim"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/healthProbeSettings/healthProbeSettings-reformscan"
          ~ name                = "healthProbeSettings-reformscan" -> "healthProbeSettings-cft-api-mgmt"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/healthProbeSettings/healthProbeSettings-labs-louisehuyton-walkthrough"
          ~ name                = "healthProbeSettings-labs-louisehuyton-walkthrough" -> "healthProbeSettings-reformscan"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/healthProbeSettings/healthProbeSettings-labs-zcwalkthrough-nodejs"
          ~ name                = "healthProbeSettings-labs-zcwalkthrough-nodejs" -> "healthProbeSettings-labs-louisehuyton-walkthrough"
            # (5 unchanged attributes hidden)
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-labs-zcwalkthrough-nodejs"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/loadBalancingSettings/loadBalancingSettings-idam-web-admin"
          ~ name                            = "loadBalancingSettings-idam-web-admin" -> "loadBalancingSettings-hmcts-access"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/loadBalancingSettings/loadBalancingSettings-idam-user-dashboard"
          ~ name                            = "loadBalancingSettings-idam-user-dashboard" -> "loadBalancingSettings-idam-web-admin"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/loadBalancingSettings/loadBalancingSettings-plum"
          ~ name                            = "loadBalancingSettings-plum" -> "loadBalancingSettings-idam-user-dashboard"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/loadBalancingSettings/loadBalancingSettings-hmi-apim"
          ~ name                            = "loadBalancingSettings-hmi-apim" -> "loadBalancingSettings-plum"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/loadBalancingSettings/loadBalancingSettings-cft-api-mgmt"
          ~ name                            = "loadBalancingSettings-cft-api-mgmt" -> "loadBalancingSettings-hmi-apim"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/loadBalancingSettings/loadBalancingSettings-reformscan"
          ~ name                            = "loadBalancingSettings-reformscan" -> "loadBalancingSettings-cft-api-mgmt"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/loadBalancingSettings/loadBalancingSettings-labs-louisehuyton-walkthrough"
          ~ name                            = "loadBalancingSettings-labs-louisehuyton-walkthrough" -> "loadBalancingSettings-reformscan"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/loadBalancingSettings/loadBalancingSettings-labs-zcwalkthrough-nodejs"
          ~ name                            = "loadBalancingSettings-labs-zcwalkthrough-nodejs" -> "loadBalancingSettings-labs-louisehuyton-walkthrough"
            # (3 unchanged attributes hidden)
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-labs-zcwalkthrough-nodejs"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      ~ frontend_endpoint {
          ~ host_name                               = "idam-web-admin.sandbox.platform.hmcts.net" -> "hmcts-access.sandbox.platform.hmcts.net"
            id                                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/idam-web-admin"
          ~ name                                    = "idam-web-admin" -> "hmcts-access"
          ~ web_application_firewall_policy_link_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebadminsbox" -> "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmctsaccesssbox"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "idam-user-dashboard.sandbox.platform.hmcts.net" -> "idam-web-admin.sandbox.platform.hmcts.net"
            id                                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/idam-user-dashboard"
          ~ name                                    = "idam-user-dashboard" -> "idam-web-admin"
          ~ web_application_firewall_policy_link_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamuserdashboardsbox" -> "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebadminsbox"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "plum.sandbox.platform.hmcts.net" -> "idam-user-dashboard.sandbox.platform.hmcts.net"
            id                                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/plum"
          ~ name                                    = "plum" -> "idam-user-dashboard"
          ~ web_application_firewall_policy_link_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/plumsbox" -> "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamuserdashboardsbox"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "hmi-apim.sandbox.platform.hmcts.net" -> "plum.sandbox.platform.hmcts.net"
            id                                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/hmi-apim"
          ~ name                                    = "hmi-apim" -> "plum"
          ~ web_application_firewall_policy_link_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmiapimsbox" -> "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/plumsbox"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "cft-api-mgmt.sandbox.platform.hmcts.net" -> "hmi-apim.sandbox.platform.hmcts.net"
            id                                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/cft-api-mgmt"
          ~ name                                    = "cft-api-mgmt" -> "hmi-apim"
          ~ web_application_firewall_policy_link_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/cftapimgmtsbox" -> "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmiapimsbox"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "reformscan.sandbox.platform.hmcts.net" -> "cft-api-mgmt.sandbox.platform.hmcts.net"
            id                                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/reformscan"
          ~ name                                    = "reformscan" -> "cft-api-mgmt"
          ~ web_application_firewall_policy_link_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/reformscansbox" -> "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/cftapimgmtsbox"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "labs-louisehuyton-walkthrough.sandbox.platform.hmcts.net" -> "reformscan.sandbox.platform.hmcts.net"
            id                                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/labs-louisehuyton-walkthrough"
          ~ name                                    = "labs-louisehuyton-walkthrough" -> "reformscan"
          ~ web_application_firewall_policy_link_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labslouisehuytonwalkthroughsbox" -> "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/reformscansbox"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "labs-zcwalkthrough-nodejs.sandbox.platform.hmcts.net" -> "labs-louisehuyton-walkthrough.sandbox.platform.hmcts.net"
            id                                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/labs-zcwalkthrough-nodejs"
          ~ name                                    = "labs-zcwalkthrough-nodejs" -> "labs-louisehuyton-walkthrough"
          ~ web_application_firewall_policy_link_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labszcwalkthroughnodejssbox" -> "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labslouisehuytonwalkthroughsbox"
            # (2 unchanged attributes hidden)
        }
      + frontend_endpoint {
          + host_name                               = "labs-zcwalkthrough-nodejs.sandbox.platform.hmcts.net"
          + name                                    = "labs-zcwalkthrough-nodejs"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labszcwalkthroughnodejssbox"
        }

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "hmcts-access",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-web-admin"
          ~ name               = "idam-web-admin" -> "hmcts-access"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "idam-web-admin" -> "hmcts-access"
                # (4 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-user-dashboard"
          ~ name               = "idam-user-dashboard" -> "idam-web-admin"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "idam-user-dashboard" -> "idam-web-admin"
                # (4 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "plum",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/plum"
          ~ name               = "plum" -> "idam-user-dashboard"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "plum" -> "idam-user-dashboard"
                # (4 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "plum",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/hmi-apim"
          ~ name               = "hmi-apim" -> "plum"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "hmi-apim" -> "plum"
              ~ cache_enabled                         = false -> true
                # (3 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/cft-api-mgmt"
          ~ name               = "cft-api-mgmt" -> "hmi-apim"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "cft-api-mgmt" -> "hmi-apim"
                # (4 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "reformscan",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/reformscan"
          ~ name               = "reformscan" -> "cft-api-mgmt"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "reformscan" -> "cft-api-mgmt"
                # (4 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "labs-louisehuyton-walkthrough",
              + "reformscan",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-louisehuyton-walkthrough"
          ~ name               = "labs-louisehuyton-walkthrough" -> "reformscan"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "labs-louisehuyton-walkthrough" -> "reformscan"
              ~ cache_enabled                         = true -> false
                # (3 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "labs-zcwalkthrough-nodejs",
              + "labs-louisehuyton-walkthrough",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-zcwalkthrough-nodejs"
          ~ name               = "labs-zcwalkthrough-nodejs" -> "labs-louisehuyton-walkthrough"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "labs-zcwalkthrough-nodejs" -> "labs-louisehuyton-walkthrough"
                # (4 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "idam-web-public",
              + "labs-zcwalkthrough-nodejs",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-web-publicHttpsRedirect"
          ~ name               = "idam-web-publicHttpsRedirect" -> "labs-zcwalkthrough-nodejs"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "labs-zcwalkthrough-nodejs"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "idam-web-public",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-web-adminHttpsRedirect"
          ~ name               = "idam-web-adminHttpsRedirect" -> "idam-web-publicHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "hmcts-access",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-user-dashboardHttpsRedirect"
          ~ name               = "idam-user-dashboardHttpsRedirect" -> "hmcts-accessHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "plum",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/plumHttpsRedirect"
          ~ name               = "plumHttpsRedirect" -> "idam-web-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/hmi-apimHttpsRedirect"
          ~ name               = "hmi-apimHttpsRedirect" -> "idam-user-dashboardHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "plum",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/cft-api-mgmtHttpsRedirect"
          ~ name               = "cft-api-mgmtHttpsRedirect" -> "plumHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "reformscan",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/reformscanHttpsRedirect"
          ~ name               = "reformscanHttpsRedirect" -> "hmi-apimHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "labs-louisehuyton-walkthrough",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-louisehuyton-walkthroughHttpsRedirect"
          ~ name               = "labs-louisehuyton-walkthroughHttpsRedirect" -> "cft-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "labs-zcwalkthrough-nodejs",
              + "reformscan",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-zcwalkthrough-nodejsHttpsRedirect"
          ~ name               = "labs-zcwalkthrough-nodejsHttpsRedirect" -> "reformscanHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "labs-louisehuyton-walkthrough",
            ]
          + name               = "labs-louisehuyton-walkthroughHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "labs-zcwalkthrough-nodejs",
            ]
          + name               = "labs-zcwalkthrough-nodejsHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (11 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["hmcts-access"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/hmcts-access"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmcts-access"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmctsaccesssbox"
        name                              = "hmctsaccesssbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-user-dashboard"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamuserdashboardsbox"
        name                              = "idamuserdashboardsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-web-public"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebpublicsbox"
        name                              = "idamwebpublicsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 1 to add, 5 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1357,"Program":"tfcmt","SHA1":"","Target":"sbox-global","Vars":{}} -->